Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsWallBaseRectangular(Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.Curve)
Identifies if the wall's base can be represented by a direct thickening of the wall's base curve.
wall:
The wall.
curve:
The wall's base curve.
Returns:
True if the wall's base can be represented by a direct thickening of the wall's base curve.
False is the wall's base shape is affected by other geometry, and thus cannot be represented
by a direct thickening of the wall's base cure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.CanExportWallGeometryAsExtrusion(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.IFC.IFCRange)
Identifies if the base geometry of the wall can be represented as an extrusion.
element:
The wall or in-place wall element.
range:
The range.  This consists of two double values representing the height in Z at the start and the end
of the range.  If the values are identical the entire wall is used.
Returns:
True if the wall export can be made in the form of an extrusion, false if the
geometry cannot be assigned to an extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012